<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"663d997abedd55d79bf3c24b90ca717b5c3e3c553a9caff364b519dffd20df5d","plan_job_ref":"Job Plan Terraform for Warehouse and DAG changes #844 at https://github.com/cal-itp/data-infra/actions/runs/18732377716","plan_out_hash":"7353aa1fd8f75d9dbf410f6c5aafc536bc90a00bcf5914fd697af73874094a90","plan_hash":"63be4f04fc09a6f9b875703d980bbea49538044c24361210105fa61043f76729","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra-staging/airflow/us__
<details>
<summary>Plan: 0 to add, 4 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-staging-composer["dags/download_gtfs_schedule_v2/README.md"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "KHF6mA==" -> (known after apply)
!~      detect_md5hash      = "3HjxKRPPTT8Y84NgGgLIAA==" -> "different hash"
!~      generation          = 1749661095007111 -> (known after apply)
        id                  = "calitp-staging-composer-dags/download_gtfs_schedule_v2/README.md"
!~      md5hash             = "3HjxKRPPTT8Y84NgGgLIAA==" -> (known after apply)
        name                = "dags/download_gtfs_schedule_v2/README.md"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/download_gtfs_schedule_v2/download_schedule_feeds.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "3CFrIg==" -> (known after apply)
!~      detect_md5hash      = "tuDGKx58gvxzc6Anuo4Sxg==" -> "different hash"
!~      generation          = 1749661091724383 -> (known after apply)
        id                  = "calitp-staging-composer-dags/download_gtfs_schedule_v2/download_schedule_feeds.py"
!~      md5hash             = "tuDGKx58gvxzc6Anuo4Sxg==" -> (known after apply)
        name                = "dags/download_gtfs_schedule_v2/download_schedule_feeds.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-catalog will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-catalog" {
!~      content             = (sensitive value)
!~      crc32c              = "t0ujbA==" -> (known after apply)
!~      detect_md5hash      = "KuSu5nvay+peOfmNPqffuA==" -> "different hash"
!~      generation          = 1761156622041180 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/target/catalog.json"
!~      md5hash             = "KuSu5nvay+peOfmNPqffuA==" -> (known after apply)
        name                = "data/warehouse/target/catalog.json"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-manifest will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-manifest" {
!~      content             = (sensitive value)
!~      crc32c              = "Sh9FUA==" -> (known after apply)
!~      detect_md5hash      = "V2wQahznMfPemhLfLyT2SQ==" -> "different hash"
!~      generation          = 1761156623807759 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/target/manifest.json"
!~      md5hash             = "V2wQahznMfPemhLfLyT2SQ==" -> (known after apply)
        name                = "data/warehouse/target/manifest.json"
#        (16 unchanged attributes hidden)
    }

Plan: 0 to add, 4 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Terraform for Warehouse and DAG changes #844](https://github.com/cal-itp/data-infra/actions/runs/18732377716)